//============================================
//
//	gimmick.cpp
//	Author: saito shian
//
//============================================

//============================================
// インクルード
//============================================
#include <assert.h>
#include "gimmick.h"
#include "game.h"
#include "player.h"
#include "bullet.h"
#include "gasolene_gimmick.h"

//============================================
// 静的メンバ変数宣言
//============================================

//============================================
// ギミックのコンストラクタ
//============================================
CGimmick::CGimmick()
{
	//============================================
	//メンバ変数のクリア
	//============================================
}

//============================================
// ギミックのデストラクタ
//============================================
CGimmick::~CGimmick()
{
	//何も書かない
}

//============================================
// ギミックの初期化処理
//============================================
HRESULT CGimmick::Init(void)
{
	//============================================
	//メンバ変数の初期化
	//============================================
	m_GimmickType = GIMMICKTYPE_NONE;

	// モデルタイプ
	SetType(OBJTYPE_GIMMICK);

	//オブジェクト基礎の初期化処理
	CObjectX::Init();

	return S_OK;
}

//============================================
// ギミックの終了処理
//============================================
void CGimmick::Uninit(void)
{
	//オブジェクト基礎の終了処理
	CObjectX::Uninit();
}

//============================================
// ギミックの更新処理
//============================================
void CGimmick::Update(void)
{
	//SetPosition(m_Pos);
}

//============================================
// ギミックの描画処理
//============================================
void CGimmick::Draw(void)
{
	//オブジェクト基礎の描画処理
	CObjectX::Draw();
}

//============================================
// ギミックの種類の設定処理
//============================================
void CGimmick::SetGimmickType(GIMMICKTYPE type)
{
	m_GimmickType = type;
}